emacs.org
#+title: Emacs Configuration

* Early Init
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./early-init.el
:END:

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

** Functions

#+begin_src emacs-lisp
  (defun gs-101/filename (name &optional default-directory)
    "Return a path to FILE suitable for the current operating system.
  DEFAULT-DIRECTORY defines where to start looking for the file."
    (if default-directory
        (convert-standard-filename (expand-file-name name default-directory))
      (convert-standard-filename (expand-file-name name))))

  (defmacro gs-101/run-at-time-daily (time &rest body)
    "Runs BODY daily at TIME."
    `(run-at-time ,time (* 60 60 24)
                  (lambda ()
                    ,@body)))
#+end_src

** Variables


#+begin_src emacs-lisp
  (defcustom gs-101/projects-code-directory (gs-101/filename "~/Projects/code/")
    "Path for project related to code, like applications."
    :type 'directory)

  (defcustom gs-101/modules-directory (gs-101/filename "modules" user-emacs-directory)
    "Path for this configuration's modules."
    :type 'directory)

  (defcustom dw/current-distro
    (or (and (eq system-type 'gnu/linux)
             (file-exists-p "/etc/os-release")
             (with-temp-buffer
               (insert-file-contents "/etc/os-release")
               (search-forward-regexp "^ID=\"?\\(.*\\)\"?$")
               (intern (or (match-string 1)
                           "unknown"))))
        'unknown)
    "Current GNU/Linux distro being used."
    :type 'symbol)

  (defvar dw/guix-p
    (eql dw/current-distro 'guix))

  (defvar gs-101/nobara-p
    (eql dw/current-distro 'nobara))
#+end_src

** Useless Code

#+begin_src emacs-lisp
  (defun gs-101/fizz-buzz (num)
    "Play the FizzBuzz game from 1 to NUM.
  This was written from a distraction while reading this:
  <https://www.theodinproject.com/lessons/foundations-problem-solving#solving-fizz-buzz>

  This is my first time using `cl-loop' for anything."
    (interactive "n")
    (cl-loop for n from 1 to num
             if (and (eq (% n 3) 0) (eq (% n 5) 0))
             collect "Fizzbuzz" into output
             if (eq (% n 3) 0)
             collect "Fizz" into output
             if (eq (% n 5) 0)
             collect "Buzz" into output
             else
             collect n into output
             finally return (print output)))
#+end_src

** Package Archives

#+begin_src emacs-lisp
  (with-eval-after-load 'package
    (dolist (archive '(("melpa" . "https://melpa.org/packages/")
                       ("jcs-elpa" . "https://jcs-emacs.github.io/jcs-elpa/packages/")))
      (add-to-list 'package-archives archive)))
#+end_src

* Load Modules
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./init.el
:END:

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp
  (add-to-list 'load-path (expand-file-name gs-101/modules-directory))

  (require 'gs-settings)
  (require 'gs-fm)
  (require 'gs-keys)
  (require 'gs-org)
  (require 'gs-org-roam)
  (require 'gs-citar)
  (require 'gs-dev)
  (require 'gs-completion)
  (require 'gs-utils)
  (require 'gs-chat)
  ;;(require 'gs-keys-evil)
  ;;(require 'gs-keys-meow)
  (require 'gs-ui)
#+end_src

* Settings
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./modules/gs-settings.el
:END:

Configuration of default Emacs packages.

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

** Default packages

*** Advice

#+begin_quote
An overloading mechanism for Emacs Lisp functions.
#+end_quote

#+begin_src emacs-lisp
  (use-package advice
    :custom
    (ad-redefinition-action 'accept))
#+end_src

*** Byte Compilation

#+begin_quote
The Emacs Lisp byte compiler. This crunches Lisp source into a sort of p-code (~lapcode~) which takes up less space and can be interpreted faster.
#+end_quote

#+begin_src emacs-lisp
  (use-package bytecomp
    :custom
    (byte-compile-warnings '(not obsolete)))
#+end_src

*** Byte Compilation

#+begin_quote
This file contains all the code needed to drive async compilations and any Lisp code needed at runtime to run native code.
#+end_quote

#+begin_src emacs-lisp
  (use-package comp-run
    :custom
    (native-comp-async-query-on-exit t)
    (native-comp-async-report-warnings-errors 'silent))
#+end_src

*** Completion Preview

#+begin_quote
Preview completion with inline overlay
#+end_quote

#+begin_src emacs-lisp
  (use-package completion-preview
    :config
    (dolist (command '(org-self-insert-command
                       org-delete-backward-char))
      (add-to-list 'completion-preview-commands command))
    :init
    (global-completion-preview-mode))
#+end_src

*** Ediff Window

#+begin_quote
Window manipulation utilities.
#+end_quote

#+begin_src emacs-lisp
  (use-package ediff-wind
    :custom
    (ediff-window-setup-function 'ediff-setup-windows-plain))
#+end_src

*** Emacs
:PROPERTIES:
:CREDITS:  1. [[https://codeberg.org/ashton314/emacs-bedrock/src/branch/main/early-init.el][ashton]], 2. [[https://github.com/gopar/.emacs.d/blob/main/README.org#recommended-packagessnippets-to-have-as-early-as-possible][gopar]], 3. [[https://github.com/jamescherti/minimal-emacs.d/blob/837e3d46acfe5a6c385b4ae253b9549d89ece1cf/early-init.el#][jamescherti]], 4. [[https://github.com/minad/vertico?tab=readme-ov-file#configuration][minad]], 5. [[https://github.com/oantolin/emacs-config/tree/master][oantolin]]
:END:

Generic package used to configure functions and variables not included in any Emacs Lisp files. This is mainly used for files defied in C code.

#+begin_src emacs-lisp
  (use-package emacs
    :custom
    (auto-save-include-big-deletions)
    (auto-window-vscroll nil) ; 3
    (bidi-inhibit-bpa t) ; 3
    (completion-ignore-case t) ; 4
    (cursor-in-non-selected-windows nil) ; 3
    (debugger-stack-frame-as-list t) ; 5
    (enable-recursive-minibuffers t)
    (fast-but-imprecise-scrolling t) ; 3
    (frame-resize-pixelwise t) ; 1
    (frame-title-format "GNU Emacs")
    (history-delete-duplicates t) ; 5
    (hscroll-margin 2) ; 3
    (hscroll-step 1) ; 3
    (inhibit-compacting-font-caches t) ; 3
    (load-prefer-newer t) ; 2
    ;; Disable the cursor in the minibuffer prompt
    ;; 4
    (minibuffer-prompt-properties
     '(cursor-intangible t read-only t face minibuffer-prompt))
    (read-buffer-completion-ignore-case t) ; 4
    (read-process-output-max (* 512 1024)) ; 3
    (resize-mini-windows 'grow-only)
    (scroll-conservatively 100000)
    (scroll-margin 2)
    (scroll-step 1)
    (text-mode-ispell-word-completion nil)
    (user-full-name "Gabriel Santos")
    (window-resize-pixelwise nil) ; 1
    (words-include-escapes t)
    :hook
    ;; 4
    (minibuffer-setup . cursor-intangible-mode))
#+end_src

*** EPG Configuration

#+begin_quote
Configuration of the EasyPG Library.
#+end_quote

#+begin_src emacs-lisp
  (use-package epg-config
    :custom
    (epg-pinentry-mode 'loopback))
#+end_src

*** Eshell
:PROPERTIES:
:CREDITS:  https://christiantietze.de/posts/2025/10/redirect-output-to-buffers-from-emacs-eshell/
:END:

#+begin_src emacs-lisp
  (use-package eshell
    :config
    (defun christiantietze/new-buffer ()
      "Create and switch to a new empty buffer named `untitled'."
      (switch-to-buffer (generate-new-buffer "untitled"))))
#+end_src

*** Files
:PROPERTIES:
:CREDITS:  1. [[https://github.com/jamescherti/minimal-emacs.d/blob/837e3d46acfe5a6c385b4ae253b9549d89ece1cf/early-init.el#L178][jamescherti]], 2. [[https://github.com/Nathan-Furnal/dotemacs/blob/45defa98dfa7a7c401ca692e9479e588896b9261/init.el#L226][nathan-furnal]], 3. [[https://github.com/oantolin/emacs-config/tree/master][oantolin]]
:END:

#+begin_quote
Defines most of Emacs's file- and directory-handling functions, including basic file visiting, backup generation, link handling, ITS-id version control, load- and write-hook handling, and the like.
#+end_quote

#+begin_src emacs-lisp
  (use-package files
    :config
    (add-hook 'after-save-hook #'executable-make-buffer-file-executable-if-script-p) ; 3
    :custom
    (auto-mode-case-fold nil)
    (backup-by-copying t) ; 2
    (backup-by-copying-when-linked t) ; 2
    (delete-old-versions t)
    (find-file-suppress-same-file-warnings t)
    (find-file-visit-truename t)
    (kept-new-versions 5) ; 2
    (kept-old-versions 5) ; 2
    (revert-without-query '("")) ; 3
    (trusted-content '("~/.emacs.d/elpa/"
                       "~/.emacs.d/modules/"
                       "~/Projects/"))
    (version-control t) ; 2
    ;; 3
    (view-read-only t))
#+end_src

*** Frame

#+begin_quote
Multi-frame management independent of window systems.
#+end_quote

This is just to remove the =suspend-frame= command, which I don't find useful. This liberates =C-z= to have it used as a prefix.

#+begin_src emacs-lisp
  (use-package frame
    :bind
    ("C-z" . nil))
#+end_src

*** grep

#+begin_quote
run `grep' and display the results.
#+end_quote

#+begin_src emacs-lisp
  (use-package grep
    :custom
    (grep-use-headings t))
#+end_src

*** Help

#+begin_quote
Help commands for Emacs.
#+end_quote

#+begin_src emacs-lisp
  (use-package help
    :custom
    (help-window-select t))
#+end_src

*** [[https://github.com/kickingvegas/casual-ibuffer?tab=readme-ov-file#configuration][iBuffer Extensions]]

#+begin_quote
Extensions for iBuffer.
#+end_quote

#+begin_src emacs-lisp
  (use-package ibuf-ext
    :hook
    (ibuffer-mode . ibuffer-auto-mode))
#+end_src

*** Image Mode
:PROPERTIES:
:CREDITS:  https://codeberg.org/zyd/dotfiles/src/commit/e2deef9551ec259e62e19abe3a9b86feb4a5c870/emacs.d/init.el#L904
:END:

#+begin_quote
Support for visiting image files.
#+end_quote

#+begin_src emacs-lisp
  (use-package image-mode
    :after dired
    :custom
    (image-animate-loop t))
#+end_src

*** iMenu

#+begin_quote
Purpose of this package:

- To present a framework for mode-specific buffer indexes;
- A buffer index is an alist of names and buffer positions.
#+end_quote

#+begin_src emacs-lisp
  (use-package imenu
    :custom
    (imenu-flatten 'annotation)
    (imenu-space-replacement nil))
#+end_src

*** Indent

#+begin_quote
Commands for making and changing indentation in text. These are described in the Emacs manual.
#+end_quote

#+begin_src emacs-lisp
  (use-package indent
    :custom
    (tab-always-indent 'complete)
    :defer t)
#+end_src

*** iSearch

#+begin_quote
Incremental search minor mode.
#+end_quote

#+begin_src emacs-lisp
  (use-package isearch
    :custom
    (isearch-allow-scroll t)
    (isearch-lazy-count t)
    (lazy-count-prefix-format "(%s/%s) ")
    (lazy-count-suffix-format nil)
    (lazy-highlight-initial-delay 0.0))
#+end_src

*** Minibuffer
:PROPERTIES:
:CREDITS:  1. [[https://codeberg.org/ashton314/emacs-bedrock/src/commit/f17a4b4d5116ac7eec3b30a0d43fa46eb074da0b/init.el#L107][ashton314]], 2. [[https://github.com/minad/vertico?tab=readme-ov-file#completion-styles-and-tab-completion][minad]]
:END:

#+begin_src emacs-lisp
  (use-package minibuffer
    :custom
    (completions-detailed t) ; 1
    (completions-format 'vertical)
    (completions-group t) ; 1
    (read-file-name-completion-ignore-case t) ; 2
    (resize-mini-windows t)
    :init
    (minibuffer-depth-indicate-mode)
    (minibuffer-electric-default-mode))
#+end_src

*** Mode Local

#+begin_quote
There are buffer local variables (and there were frame local variables). This library gives the illusion of mode specific variables.
#+end_quote

#+begin_src emacs-lisp
  (use-package mode-local)
#+end_src

*** Mouse

#+begin_quote
This package provides various useful commands (including help system access) through the mouse.  All this code assumes that mouse interpretation has been abstracted into Emacs input events.
#+end_quote

#+begin_src emacs-lisp
  (use-package mouse
    :custom
    (mouse-yank-at-point t))
#+end_src

*** Mule

Multilingual Enviroment.

#+begin_src emacs-lisp
  (use-package mule
    :config
    ;; All that is needed for UTF-8.
    (modify-coding-system-alist 'file "" 'utf-8))
#+end_src

*** New Comment

#+begin_quote
(un)comment regions of buffers.
#+end_quote

#+begin_src emacs-lisp
  (use-package newcomment
    :custom
    (comment-empty-lines t))
#+end_src

*** Paren

#+begin_quote
Highlight matching paren.
#+end_quote

#+begin_src emacs-lisp
  (use-package paren
    :config
    (custom-set-faces
     '(show-paren-match ((t :background unspecified
                            :foreground unspecified
                            :box (:line-width (-1 . -1))))))
    :custom
    (show-paren-delay 0)
    :init
    (show-paren-mode))
#+end_src

*** Save History

#+begin_quote
Save minibuffer history.
#+end_quote

#+begin_src emacs-lisp
  (use-package savehist
    :custom
    (history-length 300)
    :init
    (savehist-mode))
#+end_src

*** Secrets

#+begin_quote
This package provides an implementation of the [[https://www.freedesktop.org/wiki/Specifications/secret-storage-spec][Secret Service API]].
#+end_quote

#+begin_src emacs-lisp
  (use-package secrets)
#+end_src

*** Send Mail

#+begin_quote
This mode provides mail-sending facilities from within Emacs.
#+end_quote

#+begin_src emacs-lisp
  (use-package sendmail
    :custom
    (sendmail-program (executable-find "msmtp")))
#+end_src

*** Emacs as a Server
:PROPERTIES:
:CREDITS:  https://www.youtube.com/watch?v=nEmRr1j8LR0&t=255s
:END:

Since I'll move to Guix, I decided to dump the SystemD control over my Emacs instance and just use the regular server.

#+begin_src emacs-lisp
  (use-package server
    :demand t
    :ensure nil
    :init
    (defun positron-solutions/server ()
      "Start the Emacs server if it's not running."
      (unless (bound-and-true-p server-process)
        (server-start)))
    :init
    (positron-solutions/server))
#+end_src

*** Simple
:PROPERTIES:
:CREDITS:  1. [[https://codeberg.org/ashton314/emacs-bedrock/src/branch/main/early-init.el][ashton]], 2. [[https://github.com/gopar/.emacs.d/blob/main/README.org#simple][gopar]], 3. [[https://github.com/jamescherti/minimal-emacs.d/blob/837e3d46acfe5a6c385b4ae253b9549d89ece1cf/early-init.el#L112][jamescherti]], 4. [[https://github.com/minad/vertico?tab=readme-ov-file#configuration][minad]], 5. [[https://github.com/oantolin/emacs-config/blob/a80c3b6a4c7e0fa87254a0c148fe7f9b2976edd1/init.el#L55][oantolin]], 6. [[https://emacs.dyerdwelling.family/emacs/20241118102423-emacs--copying-buffer-to-kill-ring/][James Dyer]]
:END:

#+begin_quote
A grab-bag of basic Emacs commands not specifically related to some major mode or to file-handling.
#+end_quote

#+begin_src emacs-lisp
  (use-package simple
    :bind
    ("C-x M-h" . captainflasmr/copy-buffer-to-kill-ring)
    :custom
    (blink-matching-paren nil)
    (column-number-mode t)
    (completion-auto-select 'second-tab) ; 1
    (indent-tabs-mode nil)
    (kill-do-not-save-duplicates t) ; 5
    (kill-read-only-ok t) ; 5
    (kill-region-dwim 'emacs-word)
    (kill-whole-line t) ; 5
    ;; Hides commands in completion that are not usable in the current mode
    (read-extended-command-predicate #'command-completion-default-include-p) ; 4
    (save-interprogram-paste-before-kill t)
    (set-mark-command-repeat-pop t) ; 5
    :config
    ;; 6
    (defun captainflasmr/copy-buffer-to-kill-ring (arg)
      "Mark the whole buffer, then copy it to the kill-ring without moving point.
  With a ARG prefix argument, copy the buffer to the other window."
      (interactive "P")
      (if arg
          (save-window-excursion
            (kill-ring-save (point-min) (point-max))
            (other-window 1)
            (erase-buffer)
            (yank))
        (progn
          (save-excursion
            (kill-ring-save (point-min) (point-max)))
          (message "Buffer copied to kill-ring"))))
    :demand t)
#+end_src

