emacs.org
*** Flymake

#+begin_src emacs-lisp
  (use-package flymake
    :bind
    (:map flymake-mode-map
          ([remap next-error] . flymake-goto-next-error)
          ([remap previous-error] . flymake-goto-prev-error))
    (:map project-prefix-map
          ("t f" . flymake-show-project-diagnostics))
    (:map prog-mode-map
          ("C-c t f" . flymake-start)))
#+end_src

** [[./notes/keys_dired.org][Dired]]

#+begin_src emacs-lisp
  (use-package dired
    :after dired
    :bind
    (:map dired-mode-map
          ("b" . dired-up-directory)))
#+end_src

** Emacs

#+begin_src emacs-lisp
  (use-package emacs
    :bind
    ("C-c q f" . delete-frame)
    ("C-c i c" . insert-char))
#+end_src

** Eshell

#+begin_src emacs-lisp
  (use-package eshell
    :bind
    ("C-c t s" . eshell))
#+end_src

** Files

#+begin_src emacs-lisp
  (use-package files
    :bind
    ("<f5>" . revert-buffer)
    ("C-c f r" . recover-this-file)
    ("C-c b r" . revert-buffer)
    ("C-c q r" . restart-emacs)
    ("C-c q e" . save-buffers-kill-emacs))
#+end_src

** Git

#+begin_src emacs-lisp
  (use-package vc-git
    :bind
    ("M-s g v" . vc-git-grep))
#+end_src

** Grep

#+begin_src emacs-lisp
  (use-package grep
    :bind
    ("M-s g g" . grep)
    ("M-s g l" . lgrep)
    ("M-s g r" . rgrep))
#+end_src

** Help

#+begin_src emacs-lisp
  (use-package help
    :bind
    ("C-h C-b" . describe-prefix-bindings))
#+end_src

** iBuffer

#+begin_src emacs-lisp
  (use-package ibuffer
    :bind
    ("C-x B" . ibuffer))
#+end_src

** Org Mode

#+begin_src emacs-lisp
  (use-package org
    :bind
    (:map org-mode-map
          ([remap org-narrow-to-subtree] . org-toggle-narrow-to-subtree)
          ([remap save-buffer] . org-save-all-org-buffers)
          ("M-p" . org-move-subtree-up)
          ("M-n" . org-move-subtree-down)
          ("C-c m s e" . org-sort-entries)))
#+end_src

*** Agenda

#+begin_src emacs-lisp
  (use-package org-agenda
    :bind
    ("C-c o a" . org-agenda))
#+end_src

*** Clock

#+begin_src emacs-lisp
  (use-package org-clock
    :bind
    (:map org-mode-map
          ("C-c m c" . org-clock-in-last)
          ("C-c m C" . org-clock-cancel)))
#+end_src

*** Export

#+begin_src emacs-lisp
  (use-package ox
    :bind
    (:map org-mode-map
          ("C-c m x" . org-export-dispatch)))
#+end_src

*** Links

#+begin_src emacs-lisp
  (use-package ol
    :bind
    (:map org-mode-map
          ("C-c m l i" . org-insert-link)
          ("C-c m l s" . org-store-link)))
#+end_src

*** List

#+begin_src emacs-lisp
  (use-package org-list
    :bind
    (:map org-mode-map
          ("C-c m s l" . org-sort-list)))
#+end_src

*** Refile

#+begin_src emacs-lisp
  (use-package org-refile
    :bind
    (:map org-mode-map
          ("C-c m r" . org-refile)))
#+end_src

*** Table

#+begin_src emacs-lisp
  (use-package org-table
    :bind
    (:map org-mode-map
          ("C-c m -" . org-table-insert-hline)))
#+end_src

** Recentf

#+begin_src emacs-lisp
  (use-package recentf
    :bind
    ("M-g r" . recentf))
#+end_src

** Repeat Mode

#+begin_quote
Convenient way to repeat the previous command.
#+end_quote

#+begin_src emacs-lisp
  (use-package repeat
    :init
    (repeat-mode))
#+end_src

** Sort

#+begin_src emacs-lisp
  (use-package sort
    :bind
    ("C-c l d" . delete-duplicate-lines))
#+end_src

** Simple

#+begin_src emacs-lisp
  (use-package simple
    :bind
    ("M-g M-c" . gs-101/switch-to-minibuffer-dwim)
    ("C-?" . undo-redo)
    ("M-\\" . nil) ;; unbind `delete-horizontal-space', use `cycle-spacing' instead
    ([remap capitalize-word] . capitalize-dwim)
    ([remap upcase-word] . upcase-dwim)
    ([remap downcase-word] . downcase-dwim)
    :config
    (defun gs-101/switch-to-minibuffer-dwim ()
      "Switch to minibuffer in a regular window. In minibuffer, switch to previous window.
  If currently in the minibuffer, this function calls `previous-window-any-frame'.
  Otherwise, it calls `switch-to-minibuffer'."
      (interactive)
      (if (minibufferp)
          (previous-window-any-frame)
        (switch-to-minibuffer))))
#+end_src

** End

#+begin_src emacs-lisp
  (provide 'gs-keys)
#+end_src

* Org Mode
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./modules/gs-org.el
:END:

#+begin_quote
Org is a mode for keeping notes, maintaining ToDo lists, and doing project planning with a fast and effective plain-text system.
#+end_quote

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

#+begin_src emacs-lisp
  (use-package org
    :custom
    (org-auto-align-tags nil)
    (org-directory (gs-101/filename "~/Documents/org"))
    (org-format-latex-options '(:foreground default
                                            :background nil
                                            :scale 1.0
                                            :html-foreground "Black"
                                            :html-background "Transparent"
                                            :html-scale 1.0
                                            :matchers
                                            ("begin" "$1" "$" "$$" "\\(" "\\[")))
    (org-log-done 'time)
    (org-log-into-drawer t)
    (org-reverse-note-order t)
    (org-tags-column 0)
    (org-todo-repeat-to-state t)
    (org-use-sub-superscripts '{}))
#+end_src

** Babel

#+begin_src emacs-lisp
  (use-package org
    :config
    (dolist (language '((C . t)
                        (clojure . t)
                        (js . t)
                        (latex . t)
                        (python . t)
                        (scheme . t)
                        (sql . t)
                        (sqlite . t)))
      (add-to-list 'org-babel-load-languages language))
    :custom
    (org-export-babel-evaluate nil))
#+end_src

*** [[https://github.com/samwdp/ob-csharp][C#]]

#+begin_src emacs-lisp
  (use-package ob-csharp
    :vc (:url "https://github.com/samwdp/ob-csharp")
    :after org
    :ensure t
    :config
    (add-to-list 'org-babel-load-languages '(csharp . t)))
#+end_src

*** [[https://github.com/mzimmerm/ob-dart][Dart]]

#+begin_src emacs-lisp
  (use-package ob-dart
    :vc (:url "https://github.com/mzimmerm/ob-dart")
    :after org
    :ensure t
    :config
    (add-to-list 'org-babel-load-languages '(dart . t)))
#+end_src

*** [[https://github.com/ag91/ob-http][HTTP]]

#+begin_src emacs-lisp
  (use-package ob-http
    :vc (:url "https://github.com/ag91/ob-http")
    :after org
    :ensure t
    :config
    (add-to-list 'org-babel-load-languages '(http . t)))
#+end_src

*** [[https://github.com/AntonHakansson/org-nix-shell][Nix]]

#+begin_src emacs-lisp
  (use-package org-nix-shell
    :vc (:url "https://github.com/AntonHakansson/org-nix-shell")
    :ensure t
    :hook
    (org-mode . org-nix-shell-mode))
#+end_src

** Agenda

#+begin_quote

Dynamic task and appointment lists for Org.

#+end_quote

#+begin_src emacs-lisp
  (use-package org-agenda
    :config
    (add-to-list 'org-agenda-prefix-format '(agenda . "%-12t% s "))
    :custom
    (org-agenda-custom-commands
     '(("d" "Daily Agenda"
        ((agenda ""
                 ((org-agenda-overriding-header "* High Priority Tasks")
                  (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp "\#A"))
                  (org-agenda-span 'day)
                  (org-deadline-warning-days 0)))

         (agenda ""
                 ((org-agenda-overriding-header "* Medium Priority Tasks")
                  (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp "\#B"))
                  (org-agenda-span 'day)
                  (org-deadline-warning-days 0)))

         (agenda ""
                 ((org-agenda-overriding-header "* Low Priority Tasks")
                  (org-agenda-skip-function '(org-agenda-skip-entry-if 'notregexp "\#C"))
                  (org-agenda-span 'day)
                  (org-deadline-warning-days 0)))))))
    (org-agenda-restore-windows-after-quit t)
    (org-agenda-skip-scheduled-if-done t)
    (org-agenda-skip-timestamp-if-done t)
    (org-agenda-start-with-log-mode t)
    (org-agenda-tags-column 0)
    (org-agenda-window-setup 'only-window))
#+end_src

*** Collapsable Headers
:PROPERTIES:
:CREDITS:  https://reddit.com/r/emacs/comments/1fjnqgy/weekly_tips_tricks_c_thread/
:END:

#+begin_src emacs-lisp
  (use-package org-agenda
    :hook
    (org-agenda-mode . mlk/org-agenda-fold)
    :config
    (defun mlk/org-agenda-fold()
      "Fold headers of the agenda starting with \"* \"."
      (interactive)
      (setq-local outline-regexp "^\\* ")
      (setq-local outline-heading-end-regexp "\n")
      (setq-local outline-minor-mode-prefix (kbd "C-'"))
      (outline-minor-mode)
      (local-set-key outline-minor-mode-prefix outline-mode-prefix-map)
      (org-defkey org-agenda-mode-map [(tab)] #'outline-toggle-children)))
#+end_src

*** Org Habit

#+begin_quote
The habit tracking code for Org.
#+end_quote

#+begin_src emacs-lisp
  (use-package org-habit
    :custom
    (org-habit-graph-column 100))
#+end_src

*** [[https://liron.tilde.team/blog/skipping-weekends-when-scheduling-items-with-org-mode20758.html][Skipping Weekends]]

#+begin_src emacs-lisp
  (use-package org
    :after org
    :config
    (defun liron/org-hook-for-repeat-not-on-weekend ()
      "Makes repeating tasks skip weekends."
      (when (org-property-values "NO_WEEKEND")
        ;; Get time from item at POINT
        (let* ((scheduled-time (org-get-scheduled-time (point)))
               ;; Convert to timestamp - required for the next step
               (seconds-timestamp (time-to-seconds scheduled-time))
               ;; Convert to decoded time - required to find out the weekday
               (decoded-time (decode-time seconds-timestamp))
               ;; Get weekday
               (weekday (decoded-time-weekday decoded-time)))
          (when (> weekday 5) ;; Saturday -> move to Sunday
            (setq decoded-time
                  (decoded-time-add decoded-time (make-decoded-time :day 2))))
          (when (> weekday 6) ;; Sunday - move to Monday
            (setq decoded-time
                  (decoded-time-add decoded-time (make-decoded-time :day 1))))
          (let ((encoded-time (encode-time decoded-time)))
            (org-schedule nil encoded-time)))))
    :hook
    (org-todo-repeat . liron/org-hook-for-repeat-not-on-weekend))
#+end_src

** Clock

#+begin_quote
The time clocking code for Org mode.
#+end_quote

#+begin_src emacs-lisp
  (use-package org-clock
    :custom
    (org-clock-clocked-in-display 'frame-title)
    (org-clock-persist t)
    (org-clock-report-include-clocking-task t))
#+end_src

** Compat
:PROPERTIES:
:CREDITS:  https://github.com/xenodium/dotsies/blob/75f29e9d9d8f1aaebe1671b19614bb1e6bc5aac3/emacs/ar/ar-org-export-init.el#L37
:END:

#+begin_quote
This file contains code needed for compatibility with older versions of GNU Emacs and integration with other packages.
#+end_quote

Support for standard YouTube links is also included, translating them to embbeded links in export.

#+begin_src emacs-lisp
  (use-package org-compat
    :config
    (org-add-link-type
     "youtube"
     (lambda (handle)
       (browse-url (concat "https://www.youtube.com/watch?v=" handle)))
     (lambda (path desc backend)
       (cl-case backend
         (html (format
                "<p style='text-align:center;'>
  <iframe width='420' height='315' align='middle'
  src='https://youtube.com/embed/W4LxHn5Y_l4?controls=0'
  allowFullScreen>
  </iframe>
  </p>"
                path (or desc "")))
         (latex (format "\href{%s}{%s}" path (or desc "video"))))))
    :custom
    (org-fold-catch-invisible-edits 'show-and-error))
#+end_src

** Cycle

#+begin_quote
Visibility cycling of Org entries.
#+end_quote

#+begin_src emacs-lisp
  (use-package org-cycle
    :custom
    (org-cycle-emulate-tab 'whitestart))
#+end_src

** Latex

#+begin_quote
LaTeX Backend for Org Export Engine.
#+end_quote

#+begin_src emacs-lisp
  (use-package ox-latex
    :custom
    (org-latex-tables-centered nil)
    (org-latex-toc-command "\\tableofcontents \\pagebreak")
    (org-startup-with-latex-preview t)
    (org-preview-latex-image-directory (gs-101/filename "ltximg/" temporary-file-directory))
    :config
    (add-to-list 'org-latex-classes '("org-plain-latex"
                                      "
  \\documentclass{article}
  [NO-DEFAULT-PACKAGES]
  [PACKAGES]
  [EXTRA]
  "
                                      ("\\section{%s}" . "\\section*{%s}")
                                      ("\\subsection{%s}" . "\\subsection*{%s}")
                                      ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
                                      ("\\paragraph{%s}" . "\\paragraph*{%s}")
                                      ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))
    (add-to-list 'org-latex-pdf-process "bibtex %b" t))
#+end_src

*** [[https://code.tecosaur.net/tec/engrave-faces][Engrave Faces]]

#+begin_quote
There are some great packages for Exporting buffers to particular formats, but each one seems to reinvent the core mechanism of processing the font-lock in a buffer such that it can be exported to a particular format.

This package aims to produce a versatile generic core which can process a fontified buffer and elegantly pass the data to any number of backends which can deal with specific output formats.
#+end_quote

#+begin_src emacs-lisp
  (use-package engrave-faces
    :vc (:url "https://code.tecosaur.net/tec/engrave-faces")
    :after ox-latex
    :ensure t
    :custom
    (org-latex-src-block-backend 'engraved))
#+end_src

** List

#+begin_quote
Plain lists for Org.
#+end_quote

#+begin_src emacs-lisp
  (use-package org-list
    :custom
    (org-list-allow-alphabetical t))
#+end_src

** Modules

#+begin_src emacs-lisp
  (use-package org
    :config
    (dolist (module '(org-habit
                      org-id))
      (add-to-list 'org-modules module)))
#+end_src

** Paragraphs

#+begin_quote
Paragraph and sentence parsing.
#+end_quote

#+begin_src emacs-lisp
  (use-package paragraphs
    :custom
    (sentence-end-double-space nil)
    :defer t)
#+end_src

** Refile

#+begin_quote
Org refile allows you to refile subtrees to various locations.
#+end_quote

#+begin_src emacs-lisp
  (use-package org-refile
    :config
    (advice-add #'org-refile :after #'org-save-all-org-buffers)
    :custom
    (org-outline-path-complete-in-steps nil)
    (org-refile-allow-creating-parent-nodes 'confirm)
    (org-refile-targets '((nil :maxlevel . 1)
                          (org-agenda-files :maxlevel . 1)))
    (org-refile-use-outline-path t))
#+end_src

