emacs.org
** [[https://github.com/oantolin/embark][Embark]]

#+begin_quote
Emacs Mini-Buffer Actions Rooted in Keymaps.
#+end_quote

#+begin_src emacs-lisp
  (use-package embark
    :vc (:url "https://github.com/gs-101/embark")
    :bind
    ([remap describe-bindings]. embark-bindings)
    ("C-;" . embark-act)
    (:map embark-collect-mode-map
          ("j" . goto-char))
    :config
    ;; Hide the mode line of the Embark live/completions buffers
    (add-to-list 'display-buffer-alist
                 '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                   nil
                   (window-parameters (mode-line-format . none))))
    :custom
    (prefix-help-command #'embark-prefix-help-command)
    ;; Disable quitting after killing a buffer in an action
    (embark-quit-after-action '((kill-buffer . nil)))
    :ensure t)
#+end_src

*** Avy

#+begin_src emacs-lisp
  (use-package embark
    :after embark avy
    :config
    (defun karthinks/avy-action-embark (pt)
      "Jump to target at marker PT, and act on it using Embark."
      (unwind-protect
          (save-excursion
            (goto-char pt)
            (embark-act))
        (select-window
         (cdr (ring-ref avy-ring 0)))))

    (setf (alist-get ?\; avy-dispatch-alist) 'karthinks/avy-action-embark))
#+end_src

*** [[https://github.com/oantolin/embark?tab=readme-ov-file#consult][Consult]]

#+begin_src emacs-lisp
  (use-package embark-consult
    :hook
    (embark-collect-mode . consult-preview-at-point-mode))
#+end_src

*** [[https://github.com/oantolin/embark/wiki/Additional-Configuration#automatically-resizing-auto-updating-embark-collect-buffers-to-fit-their-contents][Collect Resizing]]

#+begin_src emacs-lisp
  (use-package embark
    :after embark
    :config
    (defun oantolin/embark-collect-resize-window (&rest _)
      "Resize the `embark-collect' window to match its contents."
      (when (memq embark-collect--kind '(:live :completions))
        (fit-window-to-buffer (get-buffer-window)
                              (floor (frame-height) 2) 1)))
    :hook
    (embark-collect-post-revert . oantolin/embark-collect-resize-window))
#+end_src

** [[https://codeberg.org/tusharhero/tinee][tinee]]

Pop-up an Emacs frame to fill in any text field (Emacs Everywhere).

#+begin_src emacs-lisp
  (use-package tinee
    :ensure-system-package
    wtype
    :vc (:url "https://codeberg.org/tusharhero/tinee")
    :ensure t)
#+end_src

** [[https://github.com/zkry/p-search][p-search]]

#+begin_quote
p-search is an Emacs tool to find things. It combines concepts from information retrievial and [[https://www2.stat.duke.edu/~banks/130-labs.dir/lab10.dir/Lab10_bayesian_search.pdf][Bayesian search theory]] to assist a user in finding documents.
#+end_quote

#+begin_src emacs-lisp
  (use-package p-search
    :vc (:url "https://github.com/zkry/p-search")
    :bind
    ("M-s p" . p-search)
    :ensure t)
#+end_src

** [[https://github.com/karthink/popper][Popper]]

#+begin_quote
Emacs minor-mode to summon and dismiss buffers easily.
#+end_quote

#+begin_src emacs-lisp
  (use-package popper
    :vc (:url "https://github.com/karthink/popper")
    :bind
    ("C-z <prior>" . popper-toggle)
    ("C-z <next>" . popper-cycle)
    ("C-z <home>" . popper-toggle-type)
    :custom
    (popper-display-control t)
    (popper-reference-buffers '(cider-repl-mode
                                compilation-mode
                                eat-mode
                                eshell-mode
                                flutter-mode
                                geiser-repl-mode
                                vterm-mode
                                inferior-emacs-lisp-mode
                                inferior-lisp-mode
                                inferior-python-mode
                                inferior-scheme-mode
                                shell-mode
                                arei-connection-mode
                                "\\*ansi-term\\*"
                                "\\*Async Shell Command\\*"
                                "\\*Backtrace\\*"
                                "\\*compilation\\*"
                                "\\*Dtache Shell Command\\*"
                                "\\*eldoc\\*"
                                "\\*Ement Notifications\\*"
                                "*Flymake diagnostics.*"
                                "\\*GDB.*out\\*"
                                "\\*Messages\\*"
                                "\\*mu4e-update\\*"
                                "Output\\*$"
                                "^*tex"
                                "\\*Warnings\\*"
                                "\\*xref\\*"))
    :ensure t
    :demand t
    :init
    (popper-mode)
    (popper-echo-mode))
#+end_src

** [[https://github.com/tbanel/uniline][Uniline]]

#+begin_quote
Easily draw Unicode lines and boxes.
#+end_quote

#+begin_src emacs-lisp
  (use-package uniline
    :vc (:url "https://github.com/tbanel/uniline")
    :bind
    ("C-z i l" . uniline-mode)
    :ensure t)
#+end_src


** [[https://thanosapollo.org/projects/yeetube/][YeeTube]]

#+begin_quote
YouTube front-end for GNU Emacs.
#+end_quote

#+begin_src emacs-lisp
  (use-package yeetube
    :ensure-system-package
    (mpv yt-dlp)
    :vc (:url "https://git.thanosapollo.org/yeetube/")
    :ensure t)
#+end_src

** End

#+begin_src emacs-lisp
  (provide 'gs-utils)
#+end_src

* Chatting
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./modules/gs-chat.el
:END:

Configuration for different chat clients.

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

** Message

#+begin_src emacs-lisp
  (use-package message
    :custom
    (message-kill-buffer-on-exit t)
    (message-mail-user-agent t)
    (message-send-mail-function #'message-send-mail-with-sendmail))
#+end_src

** SMTP

#+begin_src emacs-lisp
  (use-package smtpmail
    :custom
    (smtpmail-local-domain "gabrielsantosdesouza")
    (smtpmail-smtp-service 465)
    (smtpmail-stream-type 'ssl)
    (smtpmail-smtp-server "disroot.org"))
#+end_src

** Startup

#+begin_src emacs-lisp
  (use-package startup
    :custom
    (user-mail-address "gabrielsantosdesouza@disroot.org")
    :defer t)
#+end_src

** End

#+begin_src emacs-lisp
  (provide 'gs-chat)
#+end_src

* [[https://github.com/emacs-evil/evil][Evil Mode]]
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./modules/gs-keys-evil.el
:END:

#+begin_quote
The extensible vi layer for Emacs.
#+end_quote

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

** Simple

Bind the universal argument to another key to avoid conflicts.

#+begin_src emacs-lisp
  (use-package simple
    :bind
    ("C-M-u" . universal-argument))
#+end_src

** Emacs

This is needed for ~evil-collection~.

#+begin_src emacs-lisp
  (use-package emacs
    :custom
    (evil-want-keybinding nil))
#+end_src

** Evil

#+begin_quote
The extensible vi layer for Emacs.
#+end_quote

#+begin_src emacs-lisp
  (use-package evil
    :ensure t)
#+end_src

** Core

#+begin_quote
Core functionality.
#+end_quote

#+begin_src emacs-lisp
  (use-package evil-core
    :config
    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
    :init
    (evil-mode))
#+end_src

** Variables
:PROPERTIES:
:CREDITS:  1. [[https://codeberg.org/blau_araujo/edz/src/branch/main/parte-05/config.org#headline-28][blau_araujo]], 2. [[https://github.com/Gavinok/emacs.d/blob/main/lisp/evil-config.el][Gavinok]]
:END:

#+begin_quote
Settings and variables.
#+end_quote

#+begin_src emacs-lisp
  (use-package evil-vars
    :custom
    (evil-disable-insert-state-bindings t) ;; 2
    (evil-respect-visual-line-mode t) ;; 1
    (evil-undo-system 'undo-redo)
    (evil-split-window-below t) ;; 1
    (evil-v$-excludes-newline t) ;; 1
    (evil-vsplit-window-right t) ;; 1
    (evil-want-C-i-jump nil) ;; 1
    (evil-want-C-u-scroll t)
    (evil-want-Y-yank-to-eol t) ;; 2)
#+end_src

** Commands
:PROPERTIES:
:CREDITS:  1. [[https://codeberg.org/blau_araujo/edz/src/branch/main/parte-05/config.org#headline-28][blau_araujo]], 2. [[https://github.com/Gavinok/emacs.d/blob/main/lisp/evil-config.el][Gavinok]]
:END:

#+begin_quote
Evil commands and operators.
#+end_quote

#+begin_src emacs-lisp
  (use-package evil-commands
    :bind
    (:map evil-normal-state-map
          ("C-n" . evil-next-line)
          ("C-p" . evil-previous-line)
          (")" . evil-next-close-paren)
          ("(" . evil-previous-open-paren)))
#+end_src

** Search

#+begin_quote
Search and substitute.
#+end_quote

#+begin_src emacs-lisp
  (use-package evil-search
    :custom
    (evil-search-module 'evil-search))
#+end_src

** States
:PROPERTIES:
:CREDITS:  https://gitlab.com/dwt1/dotfiles/-/blob/master/.config/emacs/config.el#L164
:END:

The different states found in Evil Mode.

#+begin_src emacs-lisp
  (use-package evil-states
    :bind
    (:map evil-insert-state-map
          ;; In insert state, use the default quit command to return to normal state
          ("C-g" . evil-normal-state))
    (:map evil-motion-state-map
          ;; Disabled to avoid conflict with Org Mode
          ("RET" . nil)))
#+end_src

** [[https://github.com/awth13/org-appear?tab=readme-ov-file#usage][Org Appear]]

Toggles org-appear based on the current evil state.

#+begin_src emacs-lisp
  (use-package evil-core
    :after org-appear
    :custom
    (org-appear-trigger 'manual)
    :config
    (add-hook 'org-mode-hook (lambda ()
                               (add-hook 'evil-insert-state-entry-hook
                                         #'org-appear-manual-start
                                         nil
                                         t)
                               (add-hook 'evil-insert-state-exit-hook
                                         #'org-appear-manual-stop
                                         nil
                                         t))))
#+END_src

** Vertico

#+begin_src emacs-lisp
  (use-package evil-core
    :after vertico
    :bind
    (:map vertico-map
          ("C-j" . vertico-next)
          ("C-k" . vertico-previous)))
#+end_src

