modules/gs-keys-evil.el
;;; -*- lexical-binding: t -*-

(use-package simple
  :bind
  ("C-M-u" . universal-argument))

(use-package emacs
  :custom
  (evil-want-keybinding nil))

(use-package evil
  :ensure t)

(use-package evil-core
  :config
  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
  :init
  (evil-mode))

(use-package evil-vars
  :custom
  (evil-disable-insert-state-bindings t) ;; 2
  (evil-respect-visual-line-mode t) ;; 1
  (evil-undo-system 'undo-redo)
  (evil-split-window-below t) ;; 1
  (evil-v$-excludes-newline t) ;; 1
  (evil-vsplit-window-right t) ;; 1
  (evil-want-C-i-jump nil) ;; 1
  (evil-want-C-u-scroll t)
  (evil-want-Y-yank-to-eol t) ;; 2)

(use-package evil-commands
  :bind
  (:map evil-normal-state-map
        ("C-n" . evil-next-line)
        ("C-p" . evil-previous-line)
        (")" . evil-next-close-paren)
        ("(" . evil-previous-open-paren)))

(use-package evil-search
  :custom
  (evil-search-module 'evil-search))

(use-package evil-states
  :bind
  (:map evil-insert-state-map
        ;; In insert state, use the default quit command to return to normal state
        ("C-g" . evil-normal-state))
  (:map evil-motion-state-map
        ;; Disabled to avoid conflict with Org Mode
        ("RET" . nil)))

(use-package evil-core
  :after org-appear
  :custom
  (org-appear-trigger 'manual)
  :config
  (add-hook 'org-mode-hook (lambda ()
                             (add-hook 'evil-insert-state-entry-hook
                                       #'org-appear-manual-start
                                       nil
                                       t)
                             (add-hook 'evil-insert-state-exit-hook
                                       #'org-appear-manual-stop
                                       nil
                                       t))))

(use-package evil-core
  :after vertico
  :bind
  (:map vertico-map
        ("C-j" . vertico-next)
        ("C-k" . vertico-previous)))

(use-package evil-core
  :config
