modules/gs-utils.el
  :vc (:url "https://github.com/gs-101/embark")
  :bind
  ([remap describe-bindings]. embark-bindings)
  ("C-;" . embark-act)
  (:map embark-collect-mode-map
        ("j" . goto-char))
  :config
  ;; Hide the mode line of the Embark live/completions buffers
  (add-to-list 'display-buffer-alist
               '("\\`\\*Embark Collect \\(Live\\|Completions\\)\\*"
                 nil
                 (window-parameters (mode-line-format . none))))
  :custom
  (prefix-help-command #'embark-prefix-help-command)
  ;; Disable quitting after killing a buffer in an action
  (embark-quit-after-action '((kill-buffer . nil)))
  :ensure t)

(use-package embark
  :after embark avy
  :config
  (defun karthinks/avy-action-embark (pt)
    "Jump to target at marker PT, and act on it using Embark."
    (unwind-protect
        (save-excursion
          (goto-char pt)
          (embark-act))
      (select-window
       (cdr (ring-ref avy-ring 0)))))

  (setf (alist-get ?\; avy-dispatch-alist) 'karthinks/avy-action-embark))

(use-package embark-consult
  :defer t
  :hook
  (embark-collect-mode . consult-preview-at-point-mode))

(use-package embark
  :after embark
  :config
  (defun oantolin/embark-collect-resize-window (&rest _)
    "Resize the `embark-collect' window to match its contents."
    (when (memq embark-collect--kind '(:live :completions))
      (fit-window-to-buffer (get-buffer-window)
                            (floor (frame-height) 2) 1)))
  :hook
  (embark-collect-post-revert . oantolin/embark-collect-resize-window))

(use-package tinee
  :vc (:url "https://codeberg.org/tusharhero/tinee")
  :ensure t)

(use-package p-search
  :vc (:url "https://github.com/zkry/p-search")
  :bind
  ("M-s p" . p-search)
  :ensure t)

(use-package popper
  :vc (:url "https://github.com/karthink/popper")
  :bind
  ("C-z <up>" . popper-toggle)
  ("C-z <down>" . popper-cycle)
  :custom
  (popper-display-control t)
  (popper-reference-buffers '(cider-repl-mode
                              compilation-mode
                              eat-mode
                              eshell-mode
                              flutter-mode
                              geiser-repl-mode
                              vterm-mode
                              inferior-emacs-lisp-mode
                              inferior-lisp-mode
                              inferior-python-mode
                              inferior-scheme-mode
                              shell-mode
                              arei-connection-mode
                              "\\*ansi-term\\*"
                              "\\*Async Shell Command\\*"
                              "\\*Backtrace\\*"
                              "\\*compilation\\*"
                              "\\*Dtache Shell Command\\*"
                              "\\*eldoc\\*"
                              "\\*Ement Notifications\\*"
                              "*Flymake diagnostics.*"
                              "\\*GDB.*out\\*"
                              "\\*Messages\\*"
                              "\\*mu4e-update\\*"
                              "Output\\*$"
                              "^*tex"
                              "\\*Warnings\\*"
                              "\\*xref\\*"))
  :ensure t
  :demand t
  :init
  (popper-mode)
  (popper-echo-mode))

(use-package uniline
  :vc (:url "https://github.com/tbanel/uniline")
  :bind
  ("C-z i l" . uniline-mode)
  :ensure t)

(provide 'gs-utils)
