emacs.org
** [[https://reddit.com/r/emacs/comments/12zyrnk/evilsetleader_vs_generalel_for_spc_based/][Leader Keys]]

#+begin_src emacs-lisp
  (use-package evil-core
    :config
    (evil-set-leader nil (kbd "SPC"))

    (defun gs-101/evil-define-leader-key (key function)
      "Define a new KEY for Evil bound to leader + KEY to call FUNCTION."
      (evil-define-key 'normal 'global `(kbd (kbd ,(string-append "<leader>" key))) function)))
#+end_src

*** Buffer Management

#+begin_src emacs-lisp
  (use-package evil-core
    :config
    (gs-101/evil-define-leader-key "B" #'ibuffer)
    (gs-101/evil-define-leader-key "b" #'switch-to-buffer))
#+end_src

*** Character Insertion

#+begin_src emacs-lisp
  (use-package evil-core
    :config
    (gs-101/evil-define-leader-key "ie" #'emoji-insert)
    (gs-101/evil-define-leader-key "ic" #'insert-char))
#+end_src

*** File Shortcuts

#+begin_src emacs-lisp
  (use-package evil-core
    :config
    (gs-101/evil-define-leader-key "fe" #'lambda () (interactive) (find-file (expand-file-name "emacs.org" user-emacs-directory))))
#+end_src

*** Org Mode

#+begin_src emacs-lisp
  (use-package evil-core
    :config
    (gs-101/evil-define-leader-key "oa" #'org-agenda)
    (gs-101/evil-define-leader-key "oc" #'org-clock-report)
    (gs-101/evil-define-leader-key "od" #'org-deadline)
    (gs-101/evil-define-leader-key "ol" #'org-insert-link)
    (gs-101/evil-define-leader-key "os" #'org-schedule)
    (gs-101/evil-define-leader-key "op" #'org-set-property)
    (gs-101/evil-define-leader-key "ot" #'org-todo))
#+end_src

*** Window Movement

#+begin_src emacs-lisp
  (use-package evil-core
    :config
    (gs-101/evil-define-leader-key "wo" #'other-window)
    (gs-101/evil-define-leader-key "wk" #'windmove-up)
    (gs-101/evil-define-leader-key "wj" #'windmove-down)
    (gs-101/evil-define-leader-key "wh" #'windmove-left)
    (gs-101/evil-define-leader-key "wl" #'windmove-right))
#+end_src

*** Shell

#+begin_src emacs-lisp
  (use-package evil-core
    :config
    (gs-101/evil-define-leader-key "ts" #'eshell))
#+end_src

*** Magit

#+begin_src emacs-lisp
  (use-package evil-core
    :after magit
    :config
    (gs-101/evil-define-leader-key "mc" #'magit-clone)
    (gs-101/evil-define-leader-key "ms" #'magit-statusn))
#+end_src

*** Org Roam

#+begin_src emacs-lisp
  (use-package evil-core
    :after org-roam
    :config
    (gs-101/evil-define-leader-key "rb" #'dw/org-roam-capture-inbox)
    (gs-101/evil-define-leader-key "rd" #'org-roam-dailies-map)
    (gs-101/evil-define-leader-key "rf" #'org-roam-node-find)
    (gs-101/evil-define-leader-key "ri" #'org-roam-node-insert))
#+end_src

**** User Interface

*** Nerd Icons

#+begin_src emacs-lisp
  (use-package evil-core
    :after nerd-icons
    :config
    (gs-101/evil-define-leader-key "in" #'nerd-icons-insert))
#+end_src

** [[https://github.com/emacs-evil/evil-collection][Collection]]

#+begin_quote
A set of keybindings for evil-mode.
#+end_quote

#+begin_src emacs-lisp
  (use-package evil-collection
    :vc (:url "https://github.com/emacs-evil/evil-collection")
    :ensure t
    :init
    (evil-collection-init))
#+end_src

** [[https://github.com/Somelauw/evil-org-mode][Org Mode]]
:PROPERTIES:
:CREDITS:  https://github.com/daviwil/dotfiles/blob/master/.emacs.d/modules/dw-keys-evil.el
:END:

#+begin_quote
Supplemental evil-mode keybindings to emacs org-mode
#+end_quote

Why is this one not included in the collection?

#+begin_src emacs-lisp
  (use-package evil-org
    :vc (:url "https://github.com/Somelauw/evil-org-mode")
    :hook
    ((org-agenda-mode . evil-org-mode)
     (org-mode . evil-org-mode))
    :config
    (evil-org-set-key-theme '(navigation todo insert textobjects additional))
    :ensure t)
#+end_src

*** Agenda

#+begin_src emacs-lisp
  (use-package evil-org-agenda
    :config
    (evil-org-agenda-set-keys))
#+end_src

** End

#+begin_src emacs-lisp
  (provide 'gs-keys-evil)
#+end_src

* [[https://github.com/meow-edit/meow][Meow Mode]]
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./modules/gs-keys-meow.el
:END:

#+begin_quote
Yet another modal editing on Emacs.
#+end_quote

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

** Meow

#+begin_src emacs-lisp
  (use-package meow
    :vc (:url "https://github.com/meow-edit/meow")
    :ensure t)
#+end_src

** Core

#+begin_quote
Modes definition in Meow.
#+end_quote

#+begin_src emacs-lisp
  (use-package meow-core
    :init
    (meow-global-mode))
#+end_src

** Variables

#+begin_quote
Internal variables and customizable variables.
#+end_quote

#+begin_src emacs-lisp
  (use-package meow-var
    :custom
    (meow-use-clipboard t))
#+end_src

** Cheatsheet

#+begin_quote
Cheatsheet for Meow.
#+end_quote

#+begin_src emacs-lisp
  (use-package meow-cheatsheet
    :custom
    (meow-cheatsheet-layout meow-cheatsheet-layout-qwerty))
#+end_src

*** Layout

#+begin_quote
Cheatsheet layouts for Meow.
#+end_quote

#+begin_src emacs-lisp
  (use-package meow-cheatsheet-layout
    :custom
    (meow-cheatsheet-layout-qwerty t))
#+end_src

