modules/gs-keys-evil.el
  (evil-set-leader nil (kbd "SPC"))

  (defun gs-101/evil-define-leader-key (key function)
    "Define a new KEY for Evil bound to leader + KEY to call FUNCTION."
    (evil-define-key 'normal 'global `(kbd (kbd ,(string-append "<leader>" key))) function)))

(use-package evil-core
  :config
  (gs-101/evil-define-leader-key "B" #'ibuffer)
  (gs-101/evil-define-leader-key "b" #'switch-to-buffer))

(use-package evil-core
  :config
  (gs-101/evil-define-leader-key "ie" #'emoji-insert)
  (gs-101/evil-define-leader-key "ic" #'insert-char))

(use-package evil-core
  :config
  (gs-101/evil-define-leader-key "fe" #'lambda () (interactive) (find-file (expand-file-name "emacs.org" user-emacs-directory))))

(use-package evil-core
  :config
  (gs-101/evil-define-leader-key "oa" #'org-agenda)
  (gs-101/evil-define-leader-key "oc" #'org-clock-report)
  (gs-101/evil-define-leader-key "od" #'org-deadline)
  (gs-101/evil-define-leader-key "ol" #'org-insert-link)
  (gs-101/evil-define-leader-key "os" #'org-schedule)
  (gs-101/evil-define-leader-key "op" #'org-set-property)
  (gs-101/evil-define-leader-key "ot" #'org-todo))

(use-package evil-core
  :config
  (gs-101/evil-define-leader-key "wo" #'other-window)
  (gs-101/evil-define-leader-key "wk" #'windmove-up)
  (gs-101/evil-define-leader-key "wj" #'windmove-down)
  (gs-101/evil-define-leader-key "wh" #'windmove-left)
  (gs-101/evil-define-leader-key "wl" #'windmove-right))

(use-package evil-core
  :config
  (gs-101/evil-define-leader-key "ts" #'eshell))

(use-package evil-core
  :after magit
  :config
  (gs-101/evil-define-leader-key "mc" #'magit-clone)
  (gs-101/evil-define-leader-key "ms" #'magit-statusn))

(use-package evil-core
  :after org-roam
  :config
  (gs-101/evil-define-leader-key "rb" #'dw/org-roam-capture-inbox)
  (gs-101/evil-define-leader-key "rd" #'org-roam-dailies-map)
  (gs-101/evil-define-leader-key "rf" #'org-roam-node-find)
  (gs-101/evil-define-leader-key "ri" #'org-roam-node-insert))

(use-package evil-core
  :after nerd-icons
  :config
  (gs-101/evil-define-leader-key "in" #'nerd-icons-insert))

(use-package evil-collection
  :vc (:url "https://github.com/emacs-evil/evil-collection")
  :ensure t
  :init
  (evil-collection-init))

(use-package evil-org
  :vc (:url "https://github.com/Somelauw/evil-org-mode")
  :hook
  ((org-agenda-mode . evil-org-mode)
   (org-mode . evil-org-mode))
  :config
  (evil-org-set-key-theme '(navigation todo insert textobjects additional))
  :ensure t)

(use-package evil-org-agenda
  :config
  (evil-org-agenda-set-keys))

(use-package which-key
  :custom
  (which-key-allow-evil-operators t))

(provide 'gs-keys-evil)
