emacs.org
** Avy

#+begin_src emacs-lisp
  (use-package meow-command
    :after meow avy
    :bind
    (:map meow-normal-state-keymap
          ([remap meow-pop-to-mark] . favetelinguis/meow-jumper))
    :config
    (defun gs-101/meow-avy-action-kill-whole-line (pt)
      "Jump to target at marker PT, killing its whole line after the jump.
  This follows the parameters set by `meow-kill-whole-line'."
      (save-excursion
        (goto-char pt)
        (meow-kill-whole-line)))

    (defun gs-101/meow-avy-action-block (pt)
      "Mark block at PT."
      (goto-char pt)
      (meow-block pt))

    (setf
     (alist-get ?K avy-dispatch-alist) #'gs-101/meow-avy-action-kill-whole-line
     (alist-get ?m avy-dispatch-alist) #'gs-101/meow-avy-action-block)

    (defun favetelinguis/meow-jumper (&optional arg)
      "Switch between Meow search and Avy,
  depending on if the region is active.
  If the region is active, this function calls `meow-search'.
  Otherwise, it calls `avy-goto-char-timer'."
      (interactive)
      (if (region-active-p)
          (meow-search arg)
        (avy-goto-char-timer))))
#+end_src

** [[https://github.com/skissue/meow-tree-sitter][Tree-Sitter]]

#+begin_quote
Tree-sitter powered motions for Meow.
#+end_quote

#+begin_src emacs-lisp
  (use-package meow-tree-sitter
    :vc (:url "https://github.com/skissue/meow-tree-sitter")
    :ensure t
    :config
    (meow-tree-sitter-register-defaults))
#+end_src

** Embark

#+begin_src emacs-lisp
  (use-package meow-helpers
    :after embark
    :config
    (meow-normal-define-key
     '(";" . embark-act)))
#+end_src

** [[https://github.com/awth13/org-appear/issues/42#issuecomment-1063517134][Org Appear]]

#+begin_src emacs-lisp
  (use-package meow-core
    :after org-appear
    :custom
    (org-appear-trigger 'manual)
    :config
    (add-hook 'org-mode-hook (lambda ()
                               (add-hook 'meow-insert-enter-hook
                                         #'org-appear-manual-start
                                         nil
                                         t)
                               (add-hook 'meow-insert-exit-hook
                                         #'org-appear-manual-stop
                                         nil
                                         t))))
#+end_src

** End

#+begin_src emacs-lisp
  (provide 'gs-keys-meow)
#+end_src

* User Interface
:PROPERTIES:
:header-args:emacs-lisp: :results none :lexical t :mkdirp yes :tangle ./modules/gs-ui.el
:END:

#+begin_src emacs-lisp
  ;;; -*- lexical-binding: t -*-
#+end_src

** IMPORTANT

[[https://www.masteringemacs.org/article/bad-emacs-advice][Enable the menu bar if you're a new user]].
It may not look good, but it is a really useful tool.
You can disable it after getting used to Emacs.

** Emacs

#+begin_src emacs-lisp
  (use-package emacs
    :custom
    (menu-bar-mode nil)
    (ring-bell-function #'ignore)
    (scroll-preserve-screen-position t)
    (tool-bar-mode nil)
    (tooltip-mode nil)
    (use-dialog-box nil)
    (use-file-dialog nil)
    (visible-bell nil)
    (x-stretch-cursor t)
    (x-underline-at-descent-line nil))
#+END_src

** Display Line Numbers

#+begin_quote
Interface for display-line-numbers.
#+end_quote

#+begin_src emacs-lisp
  (use-package display-line-numbers
    :hook
    (prog-mode . display-line-numbers-mode))
#+end_src

** [[https://github.com/jamescherti/minimal-emacs.d/blob/837e3d46acfe5a6c385b4ae253b9549d89ece1cf/init.el#L106][Frame]]

#+begin_quote
Multi-frame management independent of window systems.
#+end_quote

#+begin_src emacs-lisp
  (use-package frame
    :config (setq-mode-local doc-view-mode blink-cursor-mode nil)
    :custom
    (window-divider-default-bottom-width 1)
    (window-divider-default-places t)
    (window-divider-default-right-width 1)
    :init
    (window-divider-mode))
#+end_src

** Mouse
:PROPERTIES:
:CREDITS:  https://codeberg.org/ashton314/emacs-bedrock/src/commit/f17a4b4d5116ac7eec3b30a0d43fa46eb074da0b/init.el#L73
:END:


#+begin_src emacs-lisp
  (use-package mouse
    :if (display-graphic-p)
    :init
    (context-menu-mode))
#+end_src

** Org Mode

*** Fontify

#+begin_src emacs-lisp
  (use-package org
    :custom
    (org-fontify-done-headline t)
    (org-fontify-quote-and-verse-blocks t)
    (org-fontify-whole-heading-line t)
    (org-hide-emphasis-markers t)
    (org-hide-leading-stars))
#+end_src

*** Prettify

#+begin_src emacs-lisp
  (use-package org
    :custom
    (org-pretty-entities t)
    (org-pretty-entities-include-sub-superscripts t))
#+end_src

*** [[https://github.com/minad/org-modern][Org Modern]]

#+begin_quote
Modern Org Style.
#+end_quote

#+begin_src emacs-lisp
  (use-package org-modern
    :vc (:url "https://github.com/minad/org-modern")
    :custom
    (org-modern-star 'replace)
    (org-modern-replace-stars "󰪥󰪤󰪣󰪢󰪡󰪠󰪟")
    (org-modern-table-vertical 1)
    :ensure t
    :init
    (global-org-modern-mode))
#+end_src

**** Prettify Agenda

#+begin_src emacs-lisp
  (use-package org-agenda
    :custom
    (org-agenda-block-separator ?─)
    (org-agenda-current-time-string
     "←──────────────")
    (org-agenda-time-grid
     '((daily today require-timed)
       (600 800 1000 1200 1400 1600 1800 2000 2200)
       " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")))
#+end_src

** Scroll Bar

#+begin_quote
Window system-independent scroll bar support.
#+end_quote

#+begin_src emacs-lisp
  (use-package scroll-bar
    :custom
    (scroll-bar-mode nil))
#+end_src

** Startup
:PROPERTIES:
:CREDITS:  https://github.com/jamescherti/minimal-emacs.d/blob/837e3d46acfe5a6c385b4ae253b9549d89ece1cf/early-init.el#L182
:END:

#+begin_quote
This file parses the command line and gets Emacs running. Options on the command line are handled in precedence order.
#+end_quote

#+begin_src emacs-lisp
  (use-package startup
    :config
    (advice-add #'display-startup-echo-area-message :override #'ignore)
    (advice-add #'display-startup-screen :override #'ignore)
    :custom
    (initial-scratch-message nil)
    (inhibit-startup-echo-area-message t)
    (inhibit-startup-message t)
    (inhibit-startup-screen t)
    :defer t)
#+end_src

** Window
:PROPERTIES:
:CREDITS:  1. [[https://github.com/jamescherti/minimal-emacs.d/blob/main/init.el][jamescherti]], 2. [[https://github.com/oantolin/emacs-config/blob/a80c3b6a4c7e0fa87254a0c148fe7f9b2976edd1/init.el][oantolin]]
:END:

#+begin_quote
Window tree functions.
#+end_quote

#+begin_src emacs-lisp
  (use-package window
    :custom
    (recenter-positions '(top middle bottom)) ; 2
    (scroll-error-top-bottom t) ; 1
    (split-height-threshold nil) ;1
    (split-width-threshold 170) ; 1
    ;; 2
    (switch-to-buffer-obey-display-actions t))
#+end_src

** [[https://github.com/catppuccin/emacs][Catppuccin]]

#+begin_quote
Soothing pastel theme for Emacs.
#+end_quote

#+begin_src emacs-lisp
  (use-package catppuccin-theme
    :vc (:url "https://github.com/catppuccin/emacs")
    :when gs-101/nobara-p
    :config
    (load-theme 'catppuccin t)
    :ensure t)
#+end_src

** [[https://github.com/laluxx/crystal-point][Crystal Point]]

Makes the cursor the color of the current face.

#+begin_src emacs-lisp
  (use-package crystal-point
    :vc (:url "https://github.com/laluxx/crystal-point")
    :init
    (crystal-point-enable)
    :ensure t)
#+end_src

** [[https://github.com/seagle0128/doom-modeline][DOOM Modeline]]

#+begin_quote
A fancy and fast mode-line inspired by minimalism design.
#+end_quote

#+begin_src emacs-lisp
  (use-package doom-modeline
    :vc (:url "https://github.com/seagle0128/doom-modeline")
    :config
    (advice-add #'doom-modeline-lsp-icon :override
                (defun gs-101/doom-modeline-lsp-icon (text face)
                  "Display LSP icon (or TEXT in terminal) with FACE.

  This advice replaces the rocket icon with a electric plug icon."
                  (if doom-modeline-lsp-icon
                      (doom-modeline-icon 'mdicon "nf-md-connection" "🔌" text :face face)
                    (propertize text 'face face))))
    :config
    ;; Enable only when there's a graphical environment available.
    (when (getenv "DISPLAY")
      (setopt doom-modeline-icon t))
    :custom
    (doom-modeline-buffer-encoding nil)
    (doom-modeline-buffer-file-name-style 'relative-to-project)
    (doom-modeline-enable-word-count t)
    (doom-modeline-icon nil)
    (doom-modeline-modal-modern-icon nil)
    :ensure t
    :init
    (doom-modeline-mode))
#+end_src

** [[https://github.com/purcell/diredfl][diredfl]]

#+begin_quote
Extra Emacs font lock rules for a more colourful dired.
#+end_quote

#+begin_src emacs-lisp
  (use-package diredfl
    :vc (:url "https://github.com/purcell/diredfl")
    :ensure t
    :hook
    (dired-mode . diredfl-mode))
#+end_src

** [[https://github.com/casouri/eldoc-box][ElDoc Box]]

#+begin_quote
Childframe doc for eglot and anything that uses eldoc.
#+end_quote

#+begin_src emacs-lisp
  (use-package eldoc-box
    :vc (:url "https://github.com/casouri/eldoc-box")
    :after eldoc
    :ensure t
    :hook
    (eldoc-box-buffer-setup . eldoc-box-prettify-ts-errors)
    (eldoc-mode . eldoc-box-hover-mode))
#+end_src

** [[https://github.com/Wilfred/helpful][Helpful]]

#+begin_quote
A better Emacs help buffer.
#+end_quote

#+begin_src emacs-lisp
  (use-package helpful
    :vc (:url "https://github.com/Wilfred/helpful")
    :bind
    ([remap describe-command] . helpful-command)
    ([remap describe-function] . helpful-callable)
    ([remap describe-key] . helpful-key)
    ([remap describe-symbol] . helpful-symbol)
    ([remap describe-variable] . helpful-variable)
    :config
    (custom-set-faces '(helpful-heading ((t :height 1.5))))
    :ensure t)
#+end_src

** [[https://github.com/tarsius/keycast][Keycast]]

#+begin_quote
Show current command and its key in the mode line.
#+end_quote

#+begin_src emacs-lisp
  (use-package keycast
    :vc (:url "https://github.com/tarsius/keycast")
    :config
    (custom-set-faces
     '(keycast-key ((t :background nil
                       :foreground nil))))
    :custom
    (echo-keystrokes 0)
    :ensure t
    :init
    (define-minor-mode keycast-mode
      "Show current command and its key binding in the mode line (fix for use with `doom-modeline')."
      :global t
      (if keycast-mode
          (add-hook 'pre-command-hook 'keycast--update t)
        (remove-hook 'pre-command-hook 'keycast--update)))
    (add-to-list 'global-mode-string '("" keycast-mode-line))
    (keycast-mode))
#+end_src

*** Command Customization

#+begin_src emacs-lisp
  (use-package keycast
    :after keycast
    :config
    (dolist (substitute '((backward-delete-char-untabify "" "Erasing...")
                          (delete-backward-char "" "Erasing...")
                          (isearch-printing-char "" "Searching...")
                          (org-delete-backward-char "" "Erasing...")
                          (self-insert-command "" "Typing...")
                          (org-self-insert-command "" "Typing...")
                          (vertico-directory-enter nil nil)
                          (vertico-next nil nil)
                          (vertico-previous nil nil)))
      (add-to-list 'keycast-substitute-alist substitute)))
#+end_src

*** [[https://github.com/oantolin/embark/wiki/Additional-Configuration#showing-embark-actions-keys-in-keycast-mode][Embark Support]]

#+begin_src emacs-lisp
  (use-package keycast
    :after embark
    :config
    (defun oantolin/keycast-store-action-key-cmd (cmd)
      "Store key and CMD command information for `keycast' use."
      (force-mode-line-update t)
      (setq this-command cmd
            keycast--this-command-keys (this-single-command-keys)
            keycast--this-command-desc cmd))
    (advice-add #'embark-keymap-prompter :filter-return #'oantolin/keycast-store-action-key-cmd)
    (defun oantolin/keycast--update-force (&rest _)
      "Version of `keycast--update' that accepts (and ignore) parameters."
      (keycast--update))
    (advice-add 'embark-act :before #'oantolin/keycast--update-force))
#+end_src

** Modus Themes

*** Guix System

#+begin_src emacs-lisp
  (use-package modus-themes
    :when dw/guix-p
    :config
    (when (file-exists-p (gs-101/filename "~/.emacs.d/var/matugen/matugen.el"))
      (load-file (gs-101/filename "~/.emacs.d/var/matugen/matugen.el"))))
#+end_src

*** Other

#+begin_src emacs-lisp
  (use-package modus-themes
    :unless dw/guix-p
    :config
    (gs-101/run-at-time-daily
     "06:00"
     (modus-themes-load-theme 'modus-operandi))

    (gs-101/run-at-time-daily
     "18:00"
     (modus-themes-load-theme 'modus-vivendi))
    :init
    (load-theme 'modus-operandi t)
    (load-theme 'modus-vivendi t))
#+end_src

*** Configuration

#+begin_src emacs-lisp
  (use-package modus-themes
    :custom
    (modus-themes-bold-constructs t)
    (modus-themes-italic-constructs t)
    (modus-themes-mixed-fonts t)
    (modus-themes-variable-pitch-ui t)
    (modus-themes-completions
     '((matches . (semibold))
       (selection . (extrabold underline)))))
#+end_src

** [[https://github.com/rainstormstudio/nerd-icons.el][Nerd Icons]]

#+begin_quote

A Library for Nerd Font icons.

#+end_quote

#+begin_src emacs-lisp
  (use-package nerd-icons
    :vc (:url "https://github.com/rainstormstudio/nerd-icons.el")
    :bind
    ("C-z i n" . nerd-icons-insert)
    :config
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (with-selected-frame frame
                  (nerd-icons-set-font))))
    :demand t
    :ensure t)
#+end_src

