modules/gs-keys-meow.el
   :map meow-normal-state-keymap
   ([remap meow-pop-to-mark] . favetelinguis/meow-jumper)
   )
  :config
  (defun gs-101/meow-avy-action-kill-whole-line (pt)
    "Jump to target at marker PT, killing its whole line after the jump.
This follows the parameters set by `meow-kill-whole-line'."
    (save-excursion
      (goto-char pt)
      (meow-kill-whole-line)))

  (defun gs-101/meow-avy-action-block (pt)
    "Mark block at PT."
    (goto-char pt)
    (meow-block pt))

  (setf
   (alist-get ?K avy-dispatch-alist) #'gs-101/meow-avy-action-kill-whole-line
   (alist-get ?m avy-dispatch-alist) #'gs-101/meow-avy-action-block
   )

  (defun favetelinguis/meow-jumper (&optional arg)
    "Switch between Meow search and Avy,
depending on if the region is active.
If the region is active, this function calls `meow-search'.
Otherwise, it calls `avy-goto-char-timer'."
    (interactive)
    (if (region-active-p)
        (meow-search arg)
      (avy-goto-char-timer)))
  )

(use-package meow-tree-sitter
  :vc (:url "https://github.com/skissue/meow-tree-sitter")
  :ensure t
  :config
  (meow-tree-sitter-register-defaults)
  )

(use-package meow-helpers
  :after embark
  :config
  (meow-normal-define-key
   '(";" . embark-act))
  )

(use-package meow-core
  :after org-appear
  :custom
  (org-appear-trigger 'manual)
  :config
  (add-hook 'org-mode-hook (lambda ()
                             (add-hook 'meow-insert-enter-hook
                                       #'org-appear-manual-start
                                       nil
                                       t)
                             (add-hook 'meow-insert-exit-hook
                                       #'org-appear-manual-stop
                                       nil
                                       t)))
  )

(provide 'gs-keys-meow)
